app/controllers/authentication_controller.rb

INSERT INTO "users" ("username", "email", "password_hash", "password_salt") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def register
    @user = User.new(user_params)

    if @user.valid?
      @user.save