app/controllers/home_controller.rb

  def index
    if current_user
      @devices = current_user.devices.all
---
SELECT  "devices".* FROM "devices" WHERE (USER_id = 1) ORDER BY "devices"."id" ASC LIMIT $1  [["LIMIT", 1]]